#import "hiriganaLibrary.h"

NSDictionary* HIRAGANA_PAIR_DICT;
NSDictionary* HIRAGANA_DICT;


void initializePairDict() {

    
    HIRAGANA_PAIR_DICT = @{@"ぁ": @"a", @"い": @"i", @"う": @"u", @"え": @"e",
                           @"お": @"o", @"か": @"ka", @"き": @"ki", @"く": @"ku",
                           @"け": @"ke", @"こ": @"ko", @"さ": @"sa", @"し": @"shi",
                           @"す": @"su", @"せ": @"se", @"そ": @"so", @"た": @"ta",
                           @"ち": @"chi", @"つ": @"tsu", @"て": @"te", @"と": @"to",
                           @"な": @"na", @"に": @"ni", @"ぬ": @"nu", @"ね": @"ne",
                           @"の": @"no", @"は": @"ha", @"ひ": @"hi", @"ふ": @"fu",
                           @"へ": @"he", @"ほ": @"ho", @"ま": @"ma", @"み": @"mi",
                           @"む": @"mu", @"め": @"me", @"も": @"mo", @"や": @"ya",
                           @"ゆ": @"yu", @"よ": @"yo", @"ら": @"ra", @"り": @"ri",
                           @"る": @"ru", @"れ": @"re", @"ろ": @"ro", @"わ": @"wa",
                           @"を": @"wo", @"が": @"ga", @"ぎ": @"gi", @"ぐ": @"gu",
                           @"げ": @"ge", @"ご": @"go", @"ざ": @"za", @"じ": @"ji",
                           @"ず": @"zu", @"ぜ": @"ze", @"ぞ": @"zo", @"だ": @"da",
                           @"ぢ": @"di", @"づ": @"du", @"で": @"de", @"ど": @"do",
                           @"ば": @"ba", @"び": @"bi", @"ぶ": @"bu", @"べ": @"be",
                           @"ぼ": @"bo", @"ぱ": @"pa", @"ぴ": @"pi", @"ぷ": @"pu",
                           @"ぺ": @"pe", @"ぽ": @"po", @"ん": @"n",
                           @"きゃ": @"kya", @"きゅ": @"kyu", @"きょ": @"kyo",
                           @"ぎゃ": @"gya", @"ぎゅ": @"gyu", @"ぎょ": @"gyo",
                           @"しゃ": @"shya", @"しゅ": @"shyu", @"しょ": @"shyo",
                           @"じゃ": @"jya", @"じゅ": @"jyu", @"じょ": @"jyo",
                           @"ちゃ": @"chya", @"ちゅ": @"chyu", @"ちょ": @"chyo",
                           @"にゃ": @"nya", @"にゅ": @"nyu", @"にょ": @"nyo",
                           @"ひゃ": @"hya", @"ひゅ": @"hyu", @"ひょ": @"hyo",
                           @"びゃ": @"bya", @"びゅ": @"byu", @"びょ": @"byo",
                           @"ぴゃ": @"pya", @"ぴゅ": @"pyu", @"ぴょ": @"pyo",
                           @"みゃ": @"mya", @"みゅ": @"myu", @"みょ": @"myo",
                           @"りゃ": @"rya", @"りゅ": @"ryu", @"りょ": @"ryo",
                           @"ぢゃ": @"dya(ja)", @"ぢゅ": @"dyu(ju)", @"ぢょ": @"dyo(jo)"
                           };
    
        HIRAGANA_DICT = @{
                      @"ぁ": @"a", @"い": @"i", @"う": @"u", @"え": @"e",
                      @"お": @"o", @"か": @"ka", @"き": @"ki", @"く": @"ku",
                      @"け": @"ke", @"こ": @"ko", @"さ": @"sa", @"し": @"shi",
                      @"す": @"su", @"せ": @"se", @"そ": @"so", @"た": @"ta",
                      @"ち": @"chi", @"つ": @"tsu", @"て": @"te", @"と": @"to",
                      @"な": @"na", @"に": @"ni", @"ぬ": @"nu", @"ね": @"ne",
                      @"の": @"no", @"は": @"ha", @"ひ": @"hi", @"ふ": @"hu",
                      @"へ": @"he", @"ほ": @"ho", @"ま": @"ma", @"み": @"mi",
                      @"む": @"mu", @"め": @"me", @"も": @"mo", @"や": @"ya",
                      @"ゆ": @"yu", @"よ": @"yo", @"ら": @"ra", @"り": @"ri",
                      @"る": @"ru", @"れ": @"re", @"ろ": @"ro", @"わ": @"wa",
                      @"を": @"wo", @"が": @"ga", @"ぎ": @"gi", @"ぐ": @"gu",
                      @"げ": @"ge", @"ご": @"go", @"ざ": @"za", @"じ": @"ji",
                      @"ず": @"zu", @"ぜ": @"ze", @"ぞ": @"zo", @"だ": @"da",
                      @"ぢ": @"di", @"づ": @"du", @"で": @"de", @"ど": @"do",
                      @"ば": @"ba", @"び": @"bi", @"ぶ": @"bu", @"べ": @"be",
                      @"ぼ": @"bo", @"ぱ": @"pa", @"ぴ": @"pi", @"ぷ": @"pu",
                      @"ぺ": @"pe", @"ぽ": @"po", @"ん": @"n"
                      };
}